----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 96, 54, 54]          11,712
              ReLU-2           [-1, 96, 54, 54]               0
 LocalResponseNorm-3           [-1, 96, 54, 54]               0
         MaxPool2d-4           [-1, 96, 26, 26]               0
            Conv2d-5          [-1, 256, 26, 26]         614,656
              ReLU-6          [-1, 256, 26, 26]               0
 LocalResponseNorm-7          [-1, 256, 26, 26]               0
         MaxPool2d-8          [-1, 256, 12, 12]               0
         Dropout2d-9          [-1, 256, 12, 12]               0
           Conv2d-10          [-1, 384, 12, 12]         885,120
             ReLU-11          [-1, 384, 12, 12]               0
           Conv2d-12          [-1, 256, 12, 12]         884,992
             ReLU-13          [-1, 256, 12, 12]               0
        MaxPool2d-14            [-1, 256, 5, 5]               0
        Dropout2d-15            [-1, 256, 5, 5]               0
           Conv2d-16           [-1, 1024, 5, 5]         263,168
             ReLU-17           [-1, 1024, 5, 5]               0
        Dropout2d-18           [-1, 1024, 5, 5]               0
           Conv2d-19           [-1, 1024, 1, 1]      26,215,424
          Flatten-20                 [-1, 1024]               0
           Conv2d-21           [-1, 96, 54, 54]          11,712
             ReLU-22           [-1, 96, 54, 54]               0
LocalResponseNorm-23           [-1, 96, 54, 54]               0
        MaxPool2d-24           [-1, 96, 26, 26]               0
           Conv2d-25          [-1, 256, 26, 26]         614,656
             ReLU-26          [-1, 256, 26, 26]               0
LocalResponseNorm-27          [-1, 256, 26, 26]               0
        MaxPool2d-28          [-1, 256, 12, 12]               0
        Dropout2d-29          [-1, 256, 12, 12]               0
           Conv2d-30          [-1, 384, 12, 12]         885,120
             ReLU-31          [-1, 384, 12, 12]               0
           Conv2d-32          [-1, 256, 12, 12]         884,992
             ReLU-33          [-1, 256, 12, 12]               0
        MaxPool2d-34            [-1, 256, 5, 5]               0
        Dropout2d-35            [-1, 256, 5, 5]               0
           Conv2d-36           [-1, 1024, 5, 5]         263,168
             ReLU-37           [-1, 1024, 5, 5]               0
        Dropout2d-38           [-1, 1024, 5, 5]               0
           Conv2d-39           [-1, 1024, 1, 1]      26,215,424
          Flatten-40                 [-1, 1024]               0
================================================================
Total params: 57,750,144
Trainable params: 57,750,144
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 64.00
Forward/backward pass size (MB): 27.06
Params size (MB): 220.30
Estimated Total Size (MB): 311.36
----------------------------------------------------------------
